examples/jmx/simple-backend.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan" enabled="true">
      <stringProp name="TestPlan.comments">fixture plan</stringProp>
    </TestPlan>
    <hashTree>
<kg.apc.jmeter.threads.UltimateThreadGroup guiclass="UltimateThreadGroupGui" testclass="kg.apc.jmeter.threads.UltimateThreadGroup" testname="Backend load" enabled="true">
  <collectionProp name="ultimatethreadgroupdata">
    <collectionProp name="row">
      <stringProp name="c0">50</stringProp>
      <stringProp name="c1">0</stringProp>
      <stringProp name="c2">120</stringProp>
      <stringProp name="c3">600</stringProp>
      <stringProp name="c4">60</stringProp>
    </collectionProp>
  </collectionProp>
</kg.apc.jmeter.threads.UltimateThreadGroup>
<hashTree>
<ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="Defaults" enabled="true">
  <stringProp name="HTTPSampler.domain">${host}</stringProp>
  <stringProp name="HTTPSampler.port">${port}</stringProp>
  <stringProp name="HTTPSampler.protocol">https</stringProp>
</ConfigTestElement>
<hashTree>

</hashTree>
<HeaderManager testclass="HeaderManager" testname="Headers" enabled="true">
  <collectionProp name="HeaderManager.headers">
    <elementProp name="" elementType="Header">
      <stringProp name="Header.name">Content-Type</stringProp>
      <stringProp name="Header.value">application/json</stringProp>
    </elementProp>
  </collectionProp>
</HeaderManager>
<hashTree>

</hashTree>
<TransactionController testclass="TransactionController" testname="catalog list" enabled="true">
  <boolProp name="TransactionController.parent">true</boolProp>
</TransactionController>
<hashTree>
<HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="get catalog" enabled="true">
  <stringProp name="HTTPSampler.method">GET</stringProp>
  <stringProp name="HTTPSampler.path">/catalog</stringProp>
</HTTPSamplerProxy>
<hashTree>
<JSONPostProcessor testclass="JSONPostProcessor" testname="ids" enabled="true">
  <stringProp name="JSONPostProcessor.referenceNames">productId;price</stringProp>
  <stringProp name="JSONPostProcessor.jsonPathExprs">$.items[0].id;$.items[0].price</stringProp>
  <stringProp name="JSONPostProcessor.match_numbers">1;1</stringProp>
  <stringProp name="JSONPostProcessor.defaultValues">MISSING;0</stringProp>
</JSONPostProcessor>
<hashTree>

</hashTree>
<ResponseAssertion testclass="ResponseAssertion" testname="status 200" enabled="true">
  <collectionProp name="Asserion.test_strings">
  <stringProp name="s0">200</stringProp>
  </collectionProp>
  <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
  <intProp name="Assertion.test_type">8</intProp>
</ResponseAssertion>
<hashTree>

</hashTree>
</hashTree>
</hashTree>
<TransactionController testclass="TransactionController" testname="catalog search" enabled="true">
  <boolProp name="TransactionController.parent">true</boolProp>
</TransactionController>
<hashTree>
<HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="search" enabled="true">
  <stringProp name="HTTPSampler.method">GET</stringProp>
  <stringProp name="HTTPSampler.path">/search?q=${term}</stringProp>
</HTTPSamplerProxy>
<hashTree>
<RegexExtractor testclass="RegexExtractor" testname="get csrf" enabled="true">
  <stringProp name="RegexExtractor.refname">csrf</stringProp>
  <stringProp name="RegexExtractor.regex">name="csrf" value="(.+?)"</stringProp>
  <stringProp name="RegexExtractor.template">$1$</stringProp>
  <stringProp name="RegexExtractor.match_number">1</stringProp>
  <stringProp name="RegexExtractor.default">NOT_FOUND</stringProp>
</RegexExtractor>
<hashTree>

</hashTree>
<ResponseAssertion testclass="ResponseAssertion" testname="status 200" enabled="true">
  <collectionProp name="Asserion.test_strings">
  <stringProp name="s0">200</stringProp>
  </collectionProp>
  <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
  <intProp name="Assertion.test_type">8</intProp>
</ResponseAssertion>
<hashTree>

</hashTree>
</hashTree>
<ConstantTimer testclass="ConstantTimer" testname="think" enabled="true">
  <stringProp name="ConstantTimer.delay">1000</stringProp>
</ConstantTimer>
<hashTree>

</hashTree>
</hashTree>
<TransactionController testclass="TransactionController" testname="checkout submit" enabled="true">
  <boolProp name="TransactionController.parent">true</boolProp>
</TransactionController>
<hashTree>
<HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="post checkout" enabled="true">
  <stringProp name="HTTPSampler.method">POST</stringProp>
  <stringProp name="HTTPSampler.path">/checkout</stringProp>
  <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
  <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
    <collectionProp name="Arguments.arguments">
      <elementProp name="" elementType="HTTPArgument">
        <stringProp name="Argument.value">{"orderId":"${requestId}","productId":"${productId}","note":"padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-padding-"}</stringProp>
      </elementProp>
    </collectionProp>
  </elementProp>
</HTTPSamplerProxy>
<hashTree>
<JSR223PreProcessor testclass="JSR223PreProcessor" testname="make request id" enabled="true">
  <stringProp name="script">def rid = UUID.randomUUID().toString()
vars.put("requestId", rid)</stringProp>
  <stringProp name="scriptLanguage">groovy</stringProp>
</JSR223PreProcessor>
<hashTree>

</hashTree>
<ResponseAssertion testclass="ResponseAssertion" testname="status 200" enabled="true">
  <collectionProp name="Asserion.test_strings">
  <stringProp name="s0">200</stringProp>
  </collectionProp>
  <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
  <intProp name="Assertion.test_type">8</intProp>
</ResponseAssertion>
<hashTree>

</hashTree>
</hashTree>
</hashTree>
</hashTree>
<Arguments guiclass="ArgumentsPanel" testclass="Arguments" testname="Env" enabled="true">
  <collectionProp name="Arguments.arguments">
    <elementProp name="" elementType="Argument">
      <stringProp name="Argument.name">BASE_URL</stringProp>
      <stringProp name="Argument.value">http://shop.local:8080</stringProp>
    </elementProp>
    <elementProp name="" elementType="Argument">
      <stringProp name="Argument.name">host</stringProp>
      <stringProp name="Argument.value">shop.local</stringProp>
    </elementProp>
    <elementProp name="" elementType="Argument">
      <stringProp name="Argument.name">port</stringProp>
      <stringProp name="Argument.value">8080</stringProp>
    </elementProp>
  </collectionProp>
</Arguments>
<hashTree>

</hashTree>
<CSVDataSet testclass="CSVDataSet" testname="search terms" enabled="true">
  <stringProp name="filename">search-terms.csv</stringProp>
  <stringProp name="variableNames">term</stringProp>
  <stringProp name="delimiter">,</stringProp>
  <boolProp name="recycle">true</boolProp>
  <boolProp name="stopThread">false</boolProp>
  <stringProp name="shareMode">shareMode.all</stringProp>
</CSVDataSet>
<hashTree>

</hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>