examples/jmx/staged-pipeline.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan" enabled="true">
      <stringProp name="TestPlan.comments">fixture plan</stringProp>
    </TestPlan>
    <hashTree>
<Arguments guiclass="ArgumentsPanel" testclass="Arguments" testname="Env" enabled="true">
  <collectionProp name="Arguments.arguments">
    <elementProp name="" elementType="Argument">
      <stringProp name="Argument.name">BASE_URL</stringProp>
      <stringProp name="Argument.value">http://shop.local:8080</stringProp>
    </elementProp>
    <elementProp name="" elementType="Argument">
      <stringProp name="Argument.name">host</stringProp>
      <stringProp name="Argument.value">shop.local</stringProp>
    </elementProp>
    <elementProp name="" elementType="Argument">
      <stringProp name="Argument.name">port</stringProp>
      <stringProp name="Argument.value">8080</stringProp>
    </elementProp>
  </collectionProp>
</Arguments>
<hashTree>

</hashTree>
<ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Stage A - producer" enabled="true">
  <stringProp name="ThreadGroup.num_threads">10</stringProp>
  <stringProp name="ThreadGroup.ramp_time">30</stringProp>
  <stringProp name="ThreadGroup.duration">600</stringProp>
  <stringProp name="ThreadGroup.delay">0</stringProp>
  <boolProp name="ThreadGroup.scheduler">true</boolProp>
</ThreadGroup>
<hashTree>
<ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="Defaults" enabled="true">
  <stringProp name="HTTPSampler.domain">${host}</stringProp>
  <stringProp name="HTTPSampler.port">${port}</stringProp>
  <stringProp name="HTTPSampler.protocol">https</stringProp>
</ConfigTestElement>
<hashTree>

</hashTree>
<TransactionController testclass="TransactionController" testname="login" enabled="true">
  <boolProp name="TransactionController.parent">true</boolProp>
</TransactionController>
<hashTree>
<HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="post login" enabled="true">
  <stringProp name="HTTPSampler.method">POST</stringProp>
  <stringProp name="HTTPSampler.path">/login</stringProp>
</HTTPSamplerProxy>
<hashTree>
<ResponseAssertion testclass="ResponseAssertion" testname="status 200" enabled="true">
  <collectionProp name="Asserion.test_strings">
  <stringProp name="s0">200</stringProp>
  </collectionProp>
  <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
  <intProp name="Assertion.test_type">8</intProp>
</ResponseAssertion>
<hashTree>

</hashTree>
<JSR223PostProcessor testclass="JSR223PostProcessor" testname="share token" enabled="true">
  <stringProp name="script">props.put("sharedToken", vars.get("token"))</stringProp>
  <stringProp name="scriptLanguage">groovy</stringProp>
</JSR223PostProcessor>
<hashTree>

</hashTree>
</hashTree>
</hashTree>
<TransactionController testclass="TransactionController" testname="kafka publish" enabled="true">
  <boolProp name="TransactionController.parent">true</boolProp>
</TransactionController>
<hashTree>
<HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="produce event" enabled="true">
  <stringProp name="HTTPSampler.method">POST</stringProp>
  <stringProp name="HTTPSampler.path">/kafka/produce?topic=orders</stringProp>
  <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
  <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
    <collectionProp name="Arguments.arguments">
      <elementProp name="" elementType="HTTPArgument">
        <stringProp name="Argument.value">{"event":"order-created","id":"${productId}"}</stringProp>
      </elementProp>
    </collectionProp>
  </elementProp>
</HTTPSamplerProxy>
<hashTree>
<ResponseAssertion testclass="ResponseAssertion" testname="status 202" enabled="true">
  <collectionProp name="Asserion.test_strings">
  <stringProp name="s0">200</stringProp>
  </collectionProp>
  <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
  <intProp name="Assertion.test_type">8</intProp>
</ResponseAssertion>
<hashTree>

</hashTree>
</hashTree>
</hashTree>
</hashTree>
<ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Stage B - consumer" enabled="true">
  <stringProp name="ThreadGroup.num_threads">5</stringProp>
  <stringProp name="ThreadGroup.ramp_time">30</stringProp>
  <stringProp name="ThreadGroup.duration">600</stringProp>
  <stringProp name="ThreadGroup.delay">1200</stringProp>
  <boolProp name="ThreadGroup.scheduler">true</boolProp>
</ThreadGroup>
<hashTree>
<ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="Defaults" enabled="true">
  <stringProp name="HTTPSampler.domain">${host}</stringProp>
  <stringProp name="HTTPSampler.port">${port}</stringProp>
  <stringProp name="HTTPSampler.protocol">https</stringProp>
</ConfigTestElement>
<hashTree>

</hashTree>
<TransactionController testclass="TransactionController" testname="settle" enabled="true">
  <boolProp name="TransactionController.parent">true</boolProp>
</TransactionController>
<hashTree>
<HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="post settle" enabled="true">
  <stringProp name="HTTPSampler.method">POST</stringProp>
  <stringProp name="HTTPSampler.path">/settle</stringProp>
</HTTPSamplerProxy>
<hashTree>
<JSR223PreProcessor testclass="JSR223PreProcessor" testname="take token" enabled="true">
  <stringProp name="script">def t = props.get("sharedToken")
def sig = SignerUtil.hmac(t, vars.get("body"))
vars.put("authSig", sig)</stringProp>
  <stringProp name="scriptLanguage">groovy</stringProp>
</JSR223PreProcessor>
<hashTree>

</hashTree>
<ResponseAssertion testclass="ResponseAssertion" testname="status 200" enabled="true">
  <collectionProp name="Asserion.test_strings">
  <stringProp name="s0">200</stringProp>
  </collectionProp>
  <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
  <intProp name="Assertion.test_type">8</intProp>
</ResponseAssertion>
<hashTree>

</hashTree>
</hashTree>
</hashTree>
<JDBCSampler testclass="JDBCSampler" testname="check ledger" enabled="true">
  <stringProp name="query">SELECT balance FROM ledger WHERE id = ${productId}</stringProp>
</JDBCSampler>
<hashTree>

</hashTree>
</hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>